posts/poems.2024-02-19.org
#+title: 2024-02-19

# oscilating lines between internal and external.
# couplet of thought 

#+begin_verse

Something curls knots deep within,
as I tred unkown familiar places.
Impressed shivers scatter my skin,
as I alone pick out outward faces.

Somehow I balance, awkward, unsteady.
Amidst sound and life and laughter 
I breathe, prepare, and once more I'm ready;
do they see my cracks as I faulter? 

Somebody said to look after help,
Somebody who's words speak straight to me.
Upon the brink of change I think
I am now and want to be. 

#+end_verse
