poems.2024-02-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2024-02-19</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tomaz GdA" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2024-02-19</h1>
<p class="verse">
<br />
Something curls knots deep within,<br />
as I tred unkown familiar places.<br />
Impressed shivers scatter my skin,<br />
as I alone pick out outward faces.<br />
<br />
Somehow I balance, awkward, unsteady.<br />
Amidst sound and life and laughter<br />
I breathe, prepare, and once more I'm ready;<br />
do they see my cracks as I faulter?<br />
<br />
Somebody said to look after help,<br />
Somebody who's words speak straight to me.<br />
Upon the brink of change I think<br />
I am now and want to be.<br />
<br />
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tomaz GdA</p>
</div>
</body>
</html>
